----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 3, 224, 224]              27
       BatchNorm2d-2          [-1, 3, 224, 224]               6
              ReLU-3          [-1, 3, 224, 224]               0
            Conv2d-4         [-1, 64, 224, 224]             256
       BatchNorm2d-5         [-1, 64, 224, 224]             128
              ReLU-6         [-1, 64, 224, 224]               0
DepthWiseSeparableConv-7         [-1, 64, 224, 224]               0
            Conv2d-8         [-1, 64, 224, 224]             576
       BatchNorm2d-9         [-1, 64, 224, 224]             128
             ReLU-10         [-1, 64, 224, 224]               0
           Conv2d-11         [-1, 64, 224, 224]           4,160
      BatchNorm2d-12         [-1, 64, 224, 224]             128
             ReLU-13         [-1, 64, 224, 224]               0
DepthWiseSeparableConv-14         [-1, 64, 224, 224]               0
          Dropout-15         [-1, 64, 224, 224]               0
        MaxPool2d-16         [-1, 64, 112, 112]               0
           Conv2d-17         [-1, 64, 112, 112]             576
      BatchNorm2d-18         [-1, 64, 112, 112]             128
             ReLU-19         [-1, 64, 112, 112]               0
           Conv2d-20        [-1, 128, 112, 112]           8,320
      BatchNorm2d-21        [-1, 128, 112, 112]             256
             ReLU-22        [-1, 128, 112, 112]               0
DepthWiseSeparableConv-23        [-1, 128, 112, 112]               0
           Conv2d-24        [-1, 128, 112, 112]           1,152
      BatchNorm2d-25        [-1, 128, 112, 112]             256
             ReLU-26        [-1, 128, 112, 112]               0
           Conv2d-27        [-1, 128, 112, 112]          16,512
      BatchNorm2d-28        [-1, 128, 112, 112]             256
             ReLU-29        [-1, 128, 112, 112]               0
DepthWiseSeparableConv-30        [-1, 128, 112, 112]               0
          Dropout-31        [-1, 128, 112, 112]               0
        MaxPool2d-32          [-1, 128, 56, 56]               0
           Conv2d-33          [-1, 128, 56, 56]           1,152
      BatchNorm2d-34          [-1, 128, 56, 56]             256
             ReLU-35          [-1, 128, 56, 56]               0
           Conv2d-36          [-1, 256, 56, 56]          33,024
      BatchNorm2d-37          [-1, 256, 56, 56]             512
             ReLU-38          [-1, 256, 56, 56]               0
DepthWiseSeparableConv-39          [-1, 256, 56, 56]               0
           Conv2d-40          [-1, 256, 56, 56]           2,304
      BatchNorm2d-41          [-1, 256, 56, 56]             512
             ReLU-42          [-1, 256, 56, 56]               0
           Conv2d-43          [-1, 256, 56, 56]          65,792
      BatchNorm2d-44          [-1, 256, 56, 56]             512
             ReLU-45          [-1, 256, 56, 56]               0
DepthWiseSeparableConv-46          [-1, 256, 56, 56]               0
          Dropout-47          [-1, 256, 56, 56]               0
        MaxPool2d-48          [-1, 256, 28, 28]               0
           Conv2d-49          [-1, 256, 28, 28]           2,304
      BatchNorm2d-50          [-1, 256, 28, 28]             512
             ReLU-51          [-1, 256, 28, 28]               0
           Conv2d-52          [-1, 512, 28, 28]         131,584
      BatchNorm2d-53          [-1, 512, 28, 28]           1,024
             ReLU-54          [-1, 512, 28, 28]               0
DepthWiseSeparableConv-55          [-1, 512, 28, 28]               0
           Conv2d-56          [-1, 512, 28, 28]           4,608
      BatchNorm2d-57          [-1, 512, 28, 28]           1,024
             ReLU-58          [-1, 512, 28, 28]               0
           Conv2d-59          [-1, 512, 28, 28]         262,656
      BatchNorm2d-60          [-1, 512, 28, 28]           1,024
             ReLU-61          [-1, 512, 28, 28]               0
DepthWiseSeparableConv-62          [-1, 512, 28, 28]               0
          Dropout-63          [-1, 512, 28, 28]               0
        MaxPool2d-64          [-1, 512, 14, 14]               0
          Dropout-65          [-1, 512, 14, 14]               0
           Conv2d-66          [-1, 512, 14, 14]           4,608
      BatchNorm2d-67          [-1, 512, 14, 14]           1,024
             ReLU-68          [-1, 512, 14, 14]               0
           Conv2d-69         [-1, 1024, 14, 14]         525,312
      BatchNorm2d-70         [-1, 1024, 14, 14]           2,048
             ReLU-71         [-1, 1024, 14, 14]               0
DepthWiseSeparableConv-72         [-1, 1024, 14, 14]               0
           Conv2d-73         [-1, 1024, 14, 14]           9,216
      BatchNorm2d-74         [-1, 1024, 14, 14]           2,048
             ReLU-75         [-1, 1024, 14, 14]               0
           Conv2d-76          [-1, 512, 14, 14]         524,800
      BatchNorm2d-77          [-1, 512, 14, 14]           1,024
             ReLU-78          [-1, 512, 14, 14]               0
DepthWiseSeparableConv-79          [-1, 512, 14, 14]               0
           Conv2d-80          [-1, 512, 14, 14]           4,608
      BatchNorm2d-81          [-1, 512, 14, 14]           1,024
             ReLU-82          [-1, 512, 14, 14]               0
           Conv2d-83         [-1, 1024, 14, 14]         525,312
      BatchNorm2d-84         [-1, 1024, 14, 14]           2,048
             ReLU-85         [-1, 1024, 14, 14]               0
DepthWiseSeparableConv-86         [-1, 1024, 14, 14]               0
          Dropout-87         [-1, 1024, 14, 14]               0
           Conv2d-88         [-1, 1024, 14, 14]           9,216
      BatchNorm2d-89         [-1, 1024, 14, 14]           2,048
             ReLU-90         [-1, 1024, 14, 14]               0
           Conv2d-91          [-1, 512, 14, 14]         524,800
      BatchNorm2d-92          [-1, 512, 14, 14]           1,024
             ReLU-93          [-1, 512, 14, 14]               0
DepthWiseSeparableConv-94          [-1, 512, 14, 14]               0
           Conv2d-95          [-1, 512, 14, 14]           4,608
      BatchNorm2d-96          [-1, 512, 14, 14]           1,024
             ReLU-97          [-1, 512, 14, 14]               0
           Conv2d-98          [-1, 512, 14, 14]         262,656
      BatchNorm2d-99          [-1, 512, 14, 14]           1,024
            ReLU-100          [-1, 512, 14, 14]               0
DepthWiseSeparableConv-101          [-1, 512, 14, 14]               0
          Conv2d-102          [-1, 512, 14, 14]           4,608
     BatchNorm2d-103          [-1, 512, 14, 14]           1,024
            ReLU-104          [-1, 512, 14, 14]               0
          Conv2d-105         [-1, 1024, 14, 14]         525,312
     BatchNorm2d-106         [-1, 1024, 14, 14]           2,048
            ReLU-107         [-1, 1024, 14, 14]               0
DepthWiseSeparableConv-108         [-1, 1024, 14, 14]               0
         Dropout-109         [-1, 1024, 14, 14]               0
          Conv2d-110         [-1, 1024, 14, 14]           9,216
     BatchNorm2d-111         [-1, 1024, 14, 14]           2,048
            ReLU-112         [-1, 1024, 14, 14]               0
          Conv2d-113          [-1, 512, 14, 14]         524,800
     BatchNorm2d-114          [-1, 512, 14, 14]           1,024
            ReLU-115          [-1, 512, 14, 14]               0
DepthWiseSeparableConv-116          [-1, 512, 14, 14]               0
          Conv2d-117          [-1, 512, 14, 14]           4,608
     BatchNorm2d-118          [-1, 512, 14, 14]           1,024
            ReLU-119          [-1, 512, 14, 14]               0
          Conv2d-120         [-1, 1024, 14, 14]         525,312
     BatchNorm2d-121         [-1, 1024, 14, 14]           2,048
            ReLU-122         [-1, 1024, 14, 14]               0
DepthWiseSeparableConv-123         [-1, 1024, 14, 14]               0
          Conv2d-124         [-1, 1024, 14, 14]           9,216
     BatchNorm2d-125         [-1, 1024, 14, 14]           2,048
            ReLU-126         [-1, 1024, 14, 14]               0
          Conv2d-127          [-1, 512, 14, 14]         524,800
     BatchNorm2d-128          [-1, 512, 14, 14]           1,024
            ReLU-129          [-1, 512, 14, 14]               0
DepthWiseSeparableConv-130          [-1, 512, 14, 14]               0
         Dropout-131          [-1, 512, 14, 14]               0
 ConvTranspose2d-132          [-1, 256, 28, 28]         524,544
         Dropout-133          [-1, 256, 28, 28]               0
          Conv2d-134          [-1, 768, 28, 28]           6,912
     BatchNorm2d-135          [-1, 768, 28, 28]           1,536
            ReLU-136          [-1, 768, 28, 28]               0
          Conv2d-137          [-1, 256, 28, 28]         196,864
     BatchNorm2d-138          [-1, 256, 28, 28]             512
            ReLU-139          [-1, 256, 28, 28]               0
DepthWiseSeparableConv-140          [-1, 256, 28, 28]               0
          Conv2d-141          [-1, 256, 28, 28]           2,304
     BatchNorm2d-142          [-1, 256, 28, 28]             512
            ReLU-143          [-1, 256, 28, 28]               0
          Conv2d-144          [-1, 256, 28, 28]          65,792
     BatchNorm2d-145          [-1, 256, 28, 28]             512
            ReLU-146          [-1, 256, 28, 28]               0
DepthWiseSeparableConv-147          [-1, 256, 28, 28]               0
         Dropout-148          [-1, 256, 28, 28]               0
 ConvTranspose2d-149          [-1, 128, 56, 56]         131,200
         Dropout-150          [-1, 128, 56, 56]               0
          Conv2d-151          [-1, 384, 56, 56]           3,456
     BatchNorm2d-152          [-1, 384, 56, 56]             768
            ReLU-153          [-1, 384, 56, 56]               0
          Conv2d-154          [-1, 128, 56, 56]          49,280
     BatchNorm2d-155          [-1, 128, 56, 56]             256
            ReLU-156          [-1, 128, 56, 56]               0
DepthWiseSeparableConv-157          [-1, 128, 56, 56]               0
          Conv2d-158          [-1, 128, 56, 56]           1,152
     BatchNorm2d-159          [-1, 128, 56, 56]             256
            ReLU-160          [-1, 128, 56, 56]               0
          Conv2d-161          [-1, 128, 56, 56]          16,512
     BatchNorm2d-162          [-1, 128, 56, 56]             256
            ReLU-163          [-1, 128, 56, 56]               0
DepthWiseSeparableConv-164          [-1, 128, 56, 56]               0
         Dropout-165          [-1, 128, 56, 56]               0
 ConvTranspose2d-166         [-1, 64, 112, 112]          32,832
         Dropout-167         [-1, 64, 112, 112]               0
          Conv2d-168        [-1, 192, 112, 112]           1,728
     BatchNorm2d-169        [-1, 192, 112, 112]             384
            ReLU-170        [-1, 192, 112, 112]               0
          Conv2d-171         [-1, 64, 112, 112]          12,352
     BatchNorm2d-172         [-1, 64, 112, 112]             128
            ReLU-173         [-1, 64, 112, 112]               0
DepthWiseSeparableConv-174         [-1, 64, 112, 112]               0
          Conv2d-175         [-1, 64, 112, 112]             576
     BatchNorm2d-176         [-1, 64, 112, 112]             128
            ReLU-177         [-1, 64, 112, 112]               0
          Conv2d-178         [-1, 64, 112, 112]           4,160
     BatchNorm2d-179         [-1, 64, 112, 112]             128
            ReLU-180         [-1, 64, 112, 112]               0
DepthWiseSeparableConv-181         [-1, 64, 112, 112]               0
         Dropout-182         [-1, 64, 112, 112]               0
 ConvTranspose2d-183         [-1, 32, 224, 224]           8,224
         Dropout-184         [-1, 32, 224, 224]               0
          Conv2d-185         [-1, 96, 224, 224]             864
     BatchNorm2d-186         [-1, 96, 224, 224]             192
            ReLU-187         [-1, 96, 224, 224]               0
          Conv2d-188         [-1, 32, 224, 224]           3,104
     BatchNorm2d-189         [-1, 32, 224, 224]              64
            ReLU-190         [-1, 32, 224, 224]               0
DepthWiseSeparableConv-191         [-1, 32, 224, 224]               0
          Conv2d-192         [-1, 32, 224, 224]             288
     BatchNorm2d-193         [-1, 32, 224, 224]              64
            ReLU-194         [-1, 32, 224, 224]               0
          Conv2d-195         [-1, 32, 224, 224]           1,056
     BatchNorm2d-196         [-1, 32, 224, 224]              64
            ReLU-197         [-1, 32, 224, 224]               0
DepthWiseSeparableConv-198         [-1, 32, 224, 224]               0
         Dropout-199         [-1, 32, 224, 224]               0
          Conv2d-200         [-1, 32, 224, 224]             288
          Conv2d-201          [-1, 1, 224, 224]              33
================================================================
Total params: 6,160,578
Trainable params: 6,160,578
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 1213.52
Params size (MB): 23.50
Estimated Total Size (MB): 1237.59
----------------------------------------------------------------
Computational complexity:       4.83 GMac / 9.67 gflops
----------------------------------------------------------------
Image 0 Inference Time: 0.0100
Image 1 Inference Time: 0.0240
Image 2 Inference Time: 0.0140
Image 3 Inference Time: 0.0160
Image 4 Inference Time: 0.0140
Image 5 Inference Time: 0.0120
Image 6 Inference Time: 0.0100
Image 7 Inference Time: 0.0110
Image 8 Inference Time: 0.0140
Image 9 Inference Time: 0.0130
Image 10 Inference Time: 0.0110
Image 11 Inference Time: 0.0140
Image 12 Inference Time: 0.0200
Image 13 Inference Time: 0.0130
Image 14 Inference Time: 0.0120
Mean Inference time per image: 0.0139
----------------------------------------------------------------
