----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 224, 224]             864
       BatchNorm2d-2         [-1, 32, 224, 224]              64
              ReLU-3         [-1, 32, 224, 224]               0
            Conv2d-4         [-1, 32, 224, 224]           9,216
       BatchNorm2d-5         [-1, 32, 224, 224]              64
              ReLU-6         [-1, 32, 224, 224]               0
         MaxPool2d-7         [-1, 32, 112, 112]               0
            Conv2d-8         [-1, 64, 112, 112]          18,432
       BatchNorm2d-9         [-1, 64, 112, 112]             128
             ReLU-10         [-1, 64, 112, 112]               0
           Conv2d-11         [-1, 64, 112, 112]          36,864
      BatchNorm2d-12         [-1, 64, 112, 112]             128
             ReLU-13         [-1, 64, 112, 112]               0
        MaxPool2d-14           [-1, 64, 56, 56]               0
           Conv2d-15          [-1, 128, 56, 56]          73,728
      BatchNorm2d-16          [-1, 128, 56, 56]             256
             ReLU-17          [-1, 128, 56, 56]               0
           Conv2d-18          [-1, 128, 56, 56]         147,456
      BatchNorm2d-19          [-1, 128, 56, 56]             256
             ReLU-20          [-1, 128, 56, 56]               0
        MaxPool2d-21          [-1, 128, 28, 28]               0
           Conv2d-22          [-1, 256, 28, 28]         294,912
      BatchNorm2d-23          [-1, 256, 28, 28]             512
             ReLU-24          [-1, 256, 28, 28]               0
           Conv2d-25          [-1, 256, 28, 28]         589,824
      BatchNorm2d-26          [-1, 256, 28, 28]             512
             ReLU-27          [-1, 256, 28, 28]               0
        MaxPool2d-28          [-1, 256, 14, 14]               0
           Conv2d-29          [-1, 512, 14, 14]       1,179,648
      BatchNorm2d-30          [-1, 512, 14, 14]           1,024
             ReLU-31          [-1, 512, 14, 14]               0
           Conv2d-32          [-1, 512, 14, 14]       2,359,296
      BatchNorm2d-33          [-1, 512, 14, 14]           1,024
             ReLU-34          [-1, 512, 14, 14]               0
  ConvTranspose2d-35          [-1, 256, 28, 28]         524,544
           Conv2d-36          [-1, 256, 28, 28]       1,179,648
      BatchNorm2d-37          [-1, 256, 28, 28]             512
             ReLU-38          [-1, 256, 28, 28]               0
           Conv2d-39          [-1, 256, 28, 28]         589,824
      BatchNorm2d-40          [-1, 256, 28, 28]             512
             ReLU-41          [-1, 256, 28, 28]               0
  ConvTranspose2d-42          [-1, 128, 56, 56]         131,200
           Conv2d-43          [-1, 128, 56, 56]         294,912
      BatchNorm2d-44          [-1, 128, 56, 56]             256
             ReLU-45          [-1, 128, 56, 56]               0
           Conv2d-46          [-1, 128, 56, 56]         147,456
      BatchNorm2d-47          [-1, 128, 56, 56]             256
             ReLU-48          [-1, 128, 56, 56]               0
  ConvTranspose2d-49         [-1, 64, 112, 112]          32,832
           Conv2d-50         [-1, 64, 112, 112]          73,728
      BatchNorm2d-51         [-1, 64, 112, 112]             128
             ReLU-52         [-1, 64, 112, 112]               0
           Conv2d-53         [-1, 64, 112, 112]          36,864
      BatchNorm2d-54         [-1, 64, 112, 112]             128
             ReLU-55         [-1, 64, 112, 112]               0
  ConvTranspose2d-56         [-1, 32, 224, 224]           8,224
           Conv2d-57         [-1, 32, 224, 224]          18,432
      BatchNorm2d-58         [-1, 32, 224, 224]              64
             ReLU-59         [-1, 32, 224, 224]               0
           Conv2d-60         [-1, 32, 224, 224]           9,216
      BatchNorm2d-61         [-1, 32, 224, 224]              64
             ReLU-62         [-1, 32, 224, 224]               0
           Conv2d-63          [-1, 1, 224, 224]              33
================================================================
Total params: 7,763,041
Trainable params: 7,763,041
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 309.31
Params size (MB): 29.61
Estimated Total Size (MB): 339.50
----------------------------------------------------------------
Computational complexity:       10.52 GMac / 21.0 GFLOPS